Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: All the content is stored as tree and blob objects, with trees corresponding to UNIX directory entries and blobs corresponding more or less to inodes or file contents.
cs: Veškerý obsah se ukládá v podobě objektů typu strom a blob. Stromy odpovídají položkám v adresáři UNIX a bloby víceméně odpovídají i-uzlům nebo obsahům souborů.

source: All the examples are written as shell scripts, with some Perl thrown in, but any properly named executable scripts will work fine — you can write them in Ruby or Python or what have you.
cs: Všechny zdejší příklady jsou napsány jako shellové skripty, tu a tam obsahující Perl, avšak všechny řádně pojmenované spustitelné skripty budou fungovat správně – můžete je napsat v Ruby, Pythonu nebo jiném jazyce.

source: All the lieutenants have one integration manager known as the benevolent dictator.
cs: Všichni poručíci mají jednoho integračního manažera, kterému se říká „benevolentní diktátor“.

source: All the objects in your Git directory.
cs: Všechny objekty v adresáři Git

source: All the sample hook scripts distributed with Git are in either Perl or Bash scripting, so you can also see plenty of examples of hooks in those languages by looking at the samples.
cs: Všechny vzorové skripty zásuvných modulů distribuované se systémem Git jsou buď ve skriptování Perl, nebo Bash. Podíváte-li se tyto vzorové skripty, budete mít i spoustu příkladů zásuvných modulů v těchto jazycích.

source: All the script does is get the latest commit date from the `git log` command, stick that into any `$Date$` strings it sees in stdin, and print the results — it should be simple to do in whatever language you’re most comfortable in.
cs: Skript pouze získá datum nejnovější revize z příkazu `git log` a rozšíří jím řetezce `$Date$`, které nalezne v standardním vstupu (stdin), a vrátí výsledek – snadno by to mělo jít provést v jakémkoli jazyce, který používáte.

source: All the server-side work will go into the update file in your hooks directory.
cs: Veškerá práce na straně serveru bude uložena do souboru update v adresáři hooks.

source: All these questions can affect how you contribute effectively to a project and what workflows are preferred or available to you.
cs: Všechny tyto otázky mohou mít vliv na efektivní přispívání do projektu a určují, jaký pracovní postup je vůbec možný a který bude upřednostněn.

source: All they have to do is copy the contents of the `.pub` file and e-mail it.
cs: Stačí přitom zkopírovat obsah souboru `.pub` a odeslat ho e-mailem.

source: All you have to do is check out the branch you wish to merge into and then run the `git merge` command:
cs: Jediné, co pro to musíte udělat, je přepnout na větev, do níž chcete tuto větev začlenit, a spustit příkaz `git merge`.

source: All you have to do is switch back to your master branch.
cs: Jediné, co teď musíte udělat, je přepnout zpět na hlavní větev.

source: All you have to do is tell `fast-import` what the content snapshots are, what commit data points to them, and the order they go in.
cs: Jediné, co tedy musíte udělat, je sdělit příkazu `fast-import`, co je obsahem snímků, jaká data revizí na ně ukazují a pořadí, v němž budou převzaty.

source: All you have to do is use `-s` instead of `-a`:
cs: Jediné, co pro to musíte udělat, je zadat místo parametru `-a` parametr `-s`:

source: All you really have to do is provide a project name, but you can also add a description.
cs: Vše, co tu opravdu musíte udělat, je zadat název projektu. Kromě toho můžete přidat i jeho popis.

source: All your branches and tags should be on your new Git server in a nice, clean import.
cs: Na novém serveru Git tak nyní máte v úhledném, čistém importu uloženy všechny větve a značky.

source: Also note the `^4832fe2` commit lines, which designate that those lines were in this file’s original commit.
cs: Všimněte si také řádků revize `^4832fe2`, které oznamují, že tyto řádky byly obsaženy v originální revizi tohoto souboru.

source: Also notice that it doesn’t need to point to a commit; you can tag any Git object.
cs: Měli byste také vědět, že nemusí ukazovat na revizi. Značkou můžete označit jakýkoli objekt Git.

source: Also, although the blob content can be nearly anything, the commit and tree content are very specifically formatted.
cs: A navíc, zatímco obsahem blobu může být téměř cokoliv, obsah revize nebo stromu má velmi specifický formát.

source: Also, as long as you stay out of contact with your origin server, your `origin/master` pointer doesn’t move (see Figure 3-23).
cs: A dokud zůstanete od serveru origin odpojeni, váš ukazatel `origin/master` se nemůže přemístit (viz obrázek 3-23).

source: Also, as you probably guessed, Gitolite prefixes `refs/heads/` as a syntactic convenience if the refex does not begin with `refs/`.
cs: Gitolite přidává prefix `refs/heads/` jako usnadnění syntaxe, pokud refex nezačíná na `refs/`, jak jste mohli odhadnout z příkladu.

source: Also, because we’re recording the parents when we commit, finding a proper merge base for merging is automatically done for us and is generally very easy to do.
cs: A protože při zapisování revize zaznamenáváme její rodiče, probíhá vyhledávání příslušné základny pro sloučení automaticky a je většinou velmi snadné.

source: Also, if you include instructions in the tag message, running `git show <tag>` will let you give the end user more specific instructions about tag verification.
cs: Pokud navíc zadáte do zprávy značky další instrukce k jejímu ověření, může si je koncový uživatel zobrazit příkazem `git show <tag>`.

source: Also, running `git pull` while on one of these branches fetches all the remote references and then automatically merges in the corresponding remote branch.
cs: Také příkazem `git pull` zadaným na sledovací větvi vyzvednete všechny vzdálené reference a Git poté odpovídající vzdálenou větev automaticky začlení.

source: Alternatively, you can type your commit message inline with the `commit` command by specifying it after a `-m` flag, like this:
cs: Zprávu k revizi můžete rovněž napsat do řádku k příkazu `commit`. Jako zprávu ji označíte tak, že před ni vložíte příznak `-m`:

source: Although Git can check to make sure each object still matches its SHA-1 checksum and points to valid objects, it doesn’t do that by default on every push.
cs: Ačkoli může při každém odesílání ověřit, že všechny objekty stále souhlasí se svým kontrolním součtem SHA-1 a ukazují k platným objektům, standardně to nedělá.

source: Although Git has an internal implementation of diff, which is what you’ve been using, you can set up an external tool instead.
cs: Ačkoli Git disponuje vlastním nástrojem diff, který jste dosud používali, můžete místo něj nastavit i libovolný externí nástroj.

source: Although Subversion automatically does such a merge on the server if different files are edited, in Git you must merge the commits locally.
cs: Přestože Subversion provádí takové sloučení na serveru automaticky, pokud byly upraveny různé soubory, v systému Git musíte provést sloučení lokálně.

source: Although `git status` answers those questions very generally, `git diff` shows you the exact lines added and removed — the patch, as it were.
cs: Zatímco příkaz `git status` vám tyto otázky zodpoví velmi obecně, příkaz `git diff` přesně zobrazí přidané a odstraněné řádky – tedy samotnou záplatu.

source: Although `rack` is a subdirectory in your working directory, Git sees it as a submodule and doesn’t track its contents when you’re not in that directory.
cs: Ačkoli je `rack` podadresářem ve vašem pracovním adresáři, Git ví, že se jedná o submodul, a dokud se v tomto adresáři nenacházíte, nesleduje jeho obsah.

source: Although it can be amazingly useful for crafting commits exactly how you want them, the staging area is sometimes a bit more complex than you need in your workflow.
cs: Přestože může být oblast připravených změn opravdu užitečným nástrojem pro přesné vytváření revizí, je někdy při daném pracovním postupu zbytečným mezikrokem.

source: Although it’s technically a text file, because it’s all ASCII, you don’t want to treat it as such because it’s really a lightweight database — you can’t merge the contents if two people changed it, and diffs generally aren’t helpful.
cs: Ačkoli se technicky jedná o textový soubor, který je celý tvořen znaky ASCII, nechcete s ním nakládat jako s textovým souborem, protože se ve skutečnosti jedná o neohrabanou databázi. Pokud ji dva lidé změní, její obsah nemůžete sloučit a většinou nepochodíte ani s nástroji diff.

source: Although this operation may take only a few minutes, if you try to copy the original repository to another remote repository instead of a local one, the process will take nearly an hour, even though there are fewer than 100 commits.
cs: Tato operace bude trvat jen několik minut. Pokud byste se však pokoušeli zkopírovat originální repozitář ne do lokálního, nýbrž do jiného vzdáleného repozitáře, protáhne se proces téměř na hodinu, přestože repozitář obsahuje necelých 100 revizí.

source: Although tons of options are available, I’ll only cover the few that either are commonly used or can significantly affect your workflow.
cs: Přestože parametrů je velmi mnoho, já se zaměřím jen na ty, které se využívají často nebo které mouhou výrazně ovlivnit váš pracovní postup.

source: Although you can easily do local branching and merging, it’s generally best to keep your history as linear as possible by rebasing your work and avoiding doing things like simultaneously interacting with a Git remote repository.
cs: Přestože není problém lokálně pracovat s větvemi a slučovat je, obecně doporučujeme, abyste se snažili udržet historii co nejlineárnější (pomůže vám v tom přeskládání) a vyhýbali se úkonům, jako je současná interakce se vzdáleným repozitářem Git.

source: Although you can technically push changes to and pull changes from individuals’ repositories, doing so is discouraged because you can fairly easily confuse what they’re working on if you’re not careful.
cs: Technicky vzato sice můžete odesílat a stahovat změny z repozitářů jednotlivých spolupracovníků, tento postup ale nedoporučujeme, protože se může při troše neopatrnosti velmi snadno stát, že zapomenete, kdo na čem pracuje.

source: Although you may have legitimate merge issues, you know where in your history their work is based; a proper three-way merge is the default rather than having to supply a `-3` and hope the patch was generated off a public commit to which you have access.
cs: Přestože můžete mít oprávněné problémy se slučováním, víte, kde ve své historii můžete hledat příčiny. Řádné třícestné sloučení je vždy lepším řešením, než zadat parametr `-3` a doufat, že byl patch vygenerován z veřejné revize, k níž máte přístup.

source: Amazing.
cs: Úžasné!

source: An alternative would be to push this new work to a different branch on the server (perhaps called `featureAv2`).
cs: Druhou možností je odeslat tuto novou práci do jiné větve na serveru (nazvané např. `featureAv2`).

source: An annotated tag is more complex, however.
cs: Anotovaná značka je už složitější.

source: An asterisk (`*`) matches zero or more characters; `[abc]` matches any character inside the brackets (in this case `a`, `b`, or `c`); a question mark (`?`) matches a single character; and brackets enclosing characters separated by a hyphen(`[0-9]`) matches any character in the range (in this case 0 through 9) .
cs: Hvězdička (`*`) označuje žádný nebo více znaků; `[abc]` označuje jakýkoli znak uvedený v závorkách (v tomto případě `a`, `b` nebo `c`); otazník (`?`) označuje jeden znak; znaky v závorkách oddělené pomlčkou (`[0-9]`) označují jakýkoli znak v daném rozmezí (v našem případě 0 až 9).

source: An important feature of the config file’s syntax is that all the rules for a repository need not be in one place.
cs: Důležitou vlastností syntaxe konfiguračního souboru je to, že všechna pravidla pro repozitáře nemusí být na jednom místě.

source: And if it was changed since it was checked out but has not been staged, it is modified.
cs: A pokud byla od poslední operace checkout změněna, ale nebyla připravena k zapsání, je považována za změněnou.

source: And make it executable
cs: Učiňte jej spustitelným:

source: And the admins can do anything (including rewind) to any ref.
cs: A skupina admins může dělat cokoliv (včetně vracení změn) v kterékoliv referenci.

source: And then define a dummy `ours` merge strategy with:
cs: A potom nadefinujete prázdnou slučovací strategii `ours` příkazem:

source: And what have you staged that you are about to commit?
cs: A co jste připravili a nyní může být zapsáno?

source: And you can specify older commits with this data, as well.
cs: Pomocí těchto dat lze rovněž specifikovat starší revize.

source: And you did all that with simple `branch` and `checkout` commands.
cs: To vše jste provedli pomocí jednoduchých příkazů `branch` a `checkout`.

source: And you’re done!
cs: To je všechno!

source: And, if you are running on Windows, this means you’ll need to take special care to not introduce carriage returns at the end your lines — `git fast-import` is very particular about just wanting line feeds (LF) not the carriage return line feeds (CRLF) that Windows uses.
cs: A to v případě používání Windows znamená, že budete muset věnovat zvláštní pozornost tomu, abyste na koncích řádků nevkládali znaky CR (carriage return). Příkaz `git fast-import` je v tomto směru velmi vybíravý a chce jen znaky LF (line feed) a nikoliv kombinaci CRLF, kterou používají Windows.

source: Annotated tags, however, are stored as full objects in the Git database.
cs: Naproti tomu anotované značky jsou ukládány jako plné objekty v databázi Git.

source: Annotating a file helps if you know where the issue is to begin with.
cs: Anotace souboru má smysl, pokud víte, kde problém hledat.

source: Another common case is that you forgot to run `git config` to set your name and e-mail address before you started working, or perhaps you want to open-source a project at work and change all your work e-mail addresses to your personal address.
cs: Dalším častým případem bývá, že uživatel zapomene spustit příkaz `git config` a nastavit své jméno a e-mailovou adresu, než začne se systémem Git pracovat. Stejně tak se může stát, že budete chtít převést pracovní projekt na otevřený zdrojový kód a změnit všechny své pracovní e-mailové adresy na soukromé.

source: Another cool thing about Git is that it doesn’t track file renames explicitly.
cs: Další skvělou věcí na systému Git je, že explicitně nesleduje přejmenování souboru.

source: Another interesting example gets `$Date$` keyword expansion, RCS style.
cs: Další zajímavý příklad se týká rozšíření klíčového slova `$Date$` ve stylu RCS.

source: Another interesting problem you can solve this way involves diffing image files.
cs: Dalším zajímavým problémem, který lze tímto způsobem řešit, je výpočet rozdílů u obrázkových souborů.

source: Another nice thing is that HTTP is such a commonly used protocol that corporate firewalls are often set up to allow traffic through this port.
cs: Z dalších výhod protokolu HTTP bychom mohli jmenovat i jeho značné rozšíření, díky čemuž jsou firemní firewally často nastaveny tak, že umožňují provoz přes standardní port protokolu HTTP.

source: Another really useful option is `--pretty`.
cs: Další opravdu užitečnou možností je parametr `--pretty`.

source: Another simple option for public unauthenticated access is to start a Git daemon, although that requires you to daemonize the process - we’ll cover this option in the next section, if you prefer that route.
cs: Další jednoduchou možností nastavení veřejného neověřovaného přístupu je spustit démona Git. Pokud je pro vás tato cesta schůdnější, budeme se jí věnovat v následující části.

source: Another thing you can do for your archives is some simple keyword substitution.
cs: Další možností pro archivy je jednoduchá substituce klíčového slova.

source: Another useful option to figure out what state your branches are in is to filter this list to branches that you have or have not yet merged into the branch you’re currently on.
cs: Další užitečnou funkcí ke zjištění stavu vašich větví je filtrování tohoto seznamu podle větví, které byly/nebyly začleněny do větve, na níž se právě nacházíte.

source: Another useful option you may want to configure is the default diff tool to use to resolve merge conflicts.
cs: Další užitečnou volbou, jejíž nastavení můžete chtít upravit, je výchozí nástroj pro zjišťování rozdílů (diff), který Git používá k řešení konfliktů při slučování (merge).

source: Another useful thing you may want to do is to keep the file in your working tree but remove it from your staging area.
cs: Další užitečnou možností, která se vám může hodit, je zachování souboru v pracovním stromě a odstranění z oblasti připravených změn.

source: Another very frequent use of this syntax is to see what you’re about to push to a remote:
cs: Tato syntaxe se velmi často používá také ke zjištění, co hodláte odeslat do vzdálené větve:

source: Another way to do it is to have your SSH server authenticate from an LDAP server or some other centralized authentication source that you may already have set up.
cs: Dalším možným způsobem je nechat ověřovat SSH přístupy LDAP serveru nebo jinému centralizovanému zdroji ověření, který už možná máte nastavený.

source: Another way to tag commits is with a lightweight tag.
cs: Další možností, jak označit revizi, je prostá značka.

source: Any push (rewind or non-rewind) to refs other than master or integ won’t match the first two rules anyway, and the third rule allows it.
cs: Jakékoliv odeslání (bez ohledu na to zda se jedná o vracení změn nebo ne) do jiných referencí než `master` nebo `integ` nebudou odpovídat ani prvnímu ani druhému pravidlu, a proto bude díky třetímu pravidlu povoleno.

source: Anything that has merge conflicts and hasn’t been resolved is listed as unmerged.
cs: Vše, co při sloučení kolidovalo a nebylo vyřešeno, je označeno jako „unmerged“ (nesloučeno).

source: Anything you didn’t stage is still sitting there modified; you can do another commit to add it to your history.
cs: Vše, co jste nepřipravili k zapsání, zůstane ve stavu změněno na vašem disku. Chcete-li i tyto soubory přidat do své historie, zapište další revizi.

source: Are all the patches peer-reviewed and approved?
cs: Jsou všechny záplaty odborně posuzovány a schvalovány?

source: Are you involved in that process?
cs: Jste součástí tohoto procesu?

source: As a final example, if you want to see which commits modifying test files in the Git source code history were committed by Junio Hamano with CommitDate being in the month of October 2008 (relative to the timezone of New York) and were not merges, you can run something like this:
cs: A poslední příklad. Pokud chcete zjistit, které revize upravující testovací soubory ve zdrojovém kódu Git zapsal Junio Hamano v říjnu 2008 (relativě k časové zóně New Yorku) a které přitom nebyly sloučením (merge), můžete zadat následující příkaz:

source: As a general rule, your messages should start with a single line that’s no more than about 50 characters and that describes the changeset concisely, followed by a blank line, followed by a more detailed explanation.
cs: Zpráva by měla obvykle začínat samostatným řádkem o maximálně 50 znacích, v níž stručně popíšete soubor provedených změn. Za ním by měl následovat prázdný řádek a za ním podrobnější popis revize.

source: As an example, if you commit and then realize you forgot to stage the changes in a file you wanted to add to this commit, you can do something like this:
cs: Pokud například zapíšete revizi a potom si uvědomíte, že jste zapomněli připravit k zapsání změny v souboru, který jste chtěli do této revize přidat, můžete provést následující:

source: As an extra precaution, you can easily restrict the 'git' user to only doing Git activities with a limited shell tool called `git-shell` that comes with Git.
cs: Pro větší bezpečnost máte možnost využít nástroj `git-shell`, který je distribuován se systémem Git. Pomocí něj lze uživatele 'git' snadno omezit tak, aby mohl prováděl pouze operace systému Git.

source: As before, you can set each value separately with a series of `git config` commands, or you can add them manually in the sendemail section in your `~/.gitconfig` file:
cs: Stejně jako v předchozím případu můžete nastavit sérií příkazů `git config` každou hodnotu zvlášť, nebo je můžete vložit ručně do sekce sendemail souboru `~/.gitconfig`:

source: As discussed in Chapter 2, there are two types of tags: annotated and lightweight.
cs: Jak jsme zmínili už v kapitole 2, existují dva typy značek: anotované a prosté.

source: As in any VCS, you can lose or mess up changes you haven’t committed yet; but after you commit a snapshot into Git, it is very difficult to lose, especially if you regularly push your database to another repository.
cs: Stejně jako ve všech systémech VCS můžete ztratit nebo nevratně zničit změny, které ještě nebyly zapsány. Jakmile však jednou zapíšete snímek do systému Git, je téměř nemožné ho ztratit, zvlášť pokud pravidelně zálohujete databázi do jiného repozitáře.

source: As long as each user can get shell access on the machine, any SSH authentication mechanism you can think of should work.
cs: Dokud má každý uživatel shellový přístup k počítači, měly by fungovat všechny mechanismy ověřování SSH, které vás jen napadnou.

source: As mentioned before, Windows uses CRLF for new line characters while `git fast-import` expects only LF.
cs: Jak už jsem se zmínil, Windows nahrazují znak konce řádku posloupností CRLF, zatímco `git fast-import` očekává pouze LF.

source: As the output will be different according to the timezone where it will be run, it's recommended to always use an absolute time such as ISO 8601 format (which includes timezone information) as argument to `--after` and `--before`, so that everone running the command will get the same repeatable results.
cs: Protože se výstup bude lišit podle časového pásma v místě spuštění, doporučuje se v argumentech `--after` a `--before` vždy používat absolutní čas (například ve formátu ISO 8601, který obsahuje i informaci o časovém pásmu). Činíme tak proto, aby každý, kdo stejný příkaz spustí, obdržel stejné, opakovatelné výsledky.

source: As with many great things in life, Git began with a bit of creative destruction and fiery controversy.
cs: Tak jako mnoho velkých věcí v lidské historii se i systém Git zrodil z kreativní destrukce a vášnivého sporu.

source: As you briefly saw in Chapter 1, you can specify Git configuration settings with the `git config` command.
cs: Jak jsme v krátkosti ukázali v kapitole 1, příkazem `git config` lze specifikovat konfigurační nastavení systému Git.

source: As you can see, the `--stat` option prints below each commit entry a list of modified files, how many files were changed, and how many lines in those files were added and removed.
cs: Jak vidíte, parametr `--stat` vypíše pod každým záznamem revize seznam změněných souborů, kolik souborů bylo změněno (changed) a kolik řádků bylo v těchto souborech vloženo (insertions) a smazáno (deletions).

source: As you can see, there is no added and removed lines in this output as in a normal diff.
cs: Jak vidíte, výstup neobsahuje žádné přidané a odstraněné řádky, jak tomu bývá u běžného zobrazení rozdílů (diff).

source: As you can see, this command lists each commit with its SHA-1 checksum, the author’s name and e-mail, the date written, and the commit message.
cs: Jak vidíte, tento příkaz vypíše všechny revize s jejich kontrolním součtem SHA-1, jménem a e-mailem autora, datem zápisu a zprávou o revizi.
